//JTPQHELO JOB CLASS=A,MSGCLASS=X                                       00000100
//STEP010 EXEC PGM=ZTPQHELO                                             00000200
//STEPLIB  DD DISP=SHR,DSN=SHARE.ENDEVOR.FINANCE.RHB01.D1.LOADLIB       00000300
//SYSPRINT DD SYSOUT=*                                                  00000400