       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZTPKSDST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDS-FILE ASSIGN TESTKSDS
           INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS KSDS-KEY
           FILE STATUS IS KSDS-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  KSDS-FILE RECORD CONTAINS 250 CHARACTERS
           DATA RECORD IS KSDS-RECORD.
       01  KSDS-RECORD.
           02  KSDS-KEY PIC X(8).
           02  KSDS-DATA PIC X(242).
       WORKING-STORAGE SECTION.
       01  KSDS-STATUS PIC X(2).
       PROCEDURE DIVISION.
           OPEN INPUT KSDS-FILE
           MOVE '00000001' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000002' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000003' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000004' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000005' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000006' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000007' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000008' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000009' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000010' TO KSDS-KEY
           READ KSDS-FILE
           MOVE '00000011' TO KSDS-KEY
           READ KSDS-FILE
           START KSDS-FILE KEY EQUAL KSDS-KEY
           CLOSE KSDS-FILE
           GOBACK.
       END PROGRAM ZTPKSDST.
