       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZTPQSAMV.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUT-FILE ASSIGN TESTQSAM
           FILE STATUS IS QSAM-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  OUTPUT-FILE RECORD IS VARYING IN SIZE
           FROM 1 TO 80 CHARACTERS DEPENDING ON REC-SIZE
           RECORDING MODE IS V
           DATA RECORD IS OUTPUT-RECORD.
       01  OUTPUT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01  REC-SIZE PIC 9(4) COMP-5.
       01  QSAM-STATUS PIC X(2).
       PROCEDURE DIVISION.
           MOVE 10 TO REC-SIZE
           OPEN OUTPUT OUTPUT-FILE
           MOVE ALL '12' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AB' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AC' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AD' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AE' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AF' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AG' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AH' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AI' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AJ' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           ADD 5 TO REC-SIZE
           MOVE ALL 'AK' TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           CLOSE OUTPUT-FILE
           OPEN INPUT OUTPUT-FILE
           DISPLAY 'JPD ST1=' QSAM-STATUS
           PERFORM UNTIL QSAM-STATUS > '04'
              READ OUTPUT-FILE
              DISPLAY 'JPDL=' REC-SIZE
              DISPLAY 'JPDD=' OUTPUT-RECORD
           DISPLAY 'JPD ST2=' QSAM-STATUS
           END-PERFORM
           CLOSE OUTPUT-FILE
           GOBACK.
       END PROGRAM ZTPQSAMV.
