       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZTPKSDSP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KSDS-FILE ASSIGN TESTKSDS
           INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS KSDS-KEY
           FILE STATUS IS KSDS-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  KSDS-FILE RECORD CONTAINS 250 CHARACTERS
           DATA RECORD IS KSDS-RECORD.
       01  KSDS-RECORD.
           02  KSDS-KEY PIC X(8).
           02  KSDS-DATA PIC X(242).
       WORKING-STORAGE SECTION.
       01  KSDS-STATUS PIC X(2).
       PROCEDURE DIVISION.
           SERVICE LABEL
           DISPLAY 'GOT TO ZTPKSDSP'
           OPEN OUTPUT KSDS-FILE
           MOVE '00000001' TO KSDS-KEY
           MOVE ALL 'A' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000002' TO KSDS-KEY
           MOVE ALL 'B' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000003' TO KSDS-KEY
           MOVE ALL 'C' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000004' TO KSDS-KEY
           MOVE ALL 'D' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000005' TO KSDS-KEY
           MOVE ALL 'E' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000006' TO KSDS-KEY
           MOVE ALL 'F' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000007' TO KSDS-KEY
           MOVE ALL 'G' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000008' TO KSDS-KEY
           MOVE ALL 'H' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000009' TO KSDS-KEY
           MOVE ALL 'I' TO KSDS-DATA
           WRITE KSDS-RECORD
           MOVE '00000010' TO KSDS-KEY
           MOVE ALL 'J' TO KSDS-DATA
           WRITE KSDS-RECORD
           CLOSE KSDS-FILE
           OPEN INPUT KSDS-FILE
           MOVE '00000001' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC01=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000002' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC02=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000003' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC03=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000004' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC04=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000005' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC05=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000006' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC06=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000007' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC07=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000008' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC08=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000009' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC09=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000010' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC10=' KSDS-RECORD ' ' KSDS-STATUS
           MOVE '00000011' TO KSDS-KEY
           READ KSDS-FILE
           DISPLAY 'REC11=' KSDS-RECORD ' ' KSDS-STATUS
           START KSDS-FILE KEY EQUAL KSDS-KEY
           DISPLAY 'REC12=' KSDS-RECORD ' ' KSDS-STATUS
           CLOSE KSDS-FILE
           OPEN I-O KSDS-FILE
           MOVE '00000001' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000002' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000003' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000004' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000005' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000006' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000007' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000008' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000009' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000010' TO KSDS-KEY
           DELETE KSDS-FILE
           MOVE '00000011' TO KSDS-KEY
           DELETE KSDS-FILE
           CLOSE KSDS-FILE
           GOBACK.
       END PROGRAM ZTPKSDSP.
