       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'ZTPPROGR' RECURSIVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       1 ANIMAL-LIST.
         2 PIC X(26) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
       1 ANIMAL PIC X(10) VALUE SPACES.
       1 ANIMAL-TYPE PIC X(1).
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           PERFORM VARYING TALLY FROM 1 BY 1 UNTIL TALLY > 26
              MOVE ANIMAL-LIST(TALLY: 1) TO ANIMAL-TYPE
              CALL 'ZTPCALLD' USING ANIMAL-TYPE ANIMAL
              DISPLAY 'ZTPCALLD RETURNED ' ANIMAL ' FOR TYPE='
                 ANIMAL-TYPE
           END-PERFORM
           GOBACK.
