       PROCESS PGMN(LM),DYNAM
       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'ZTPPARAT' RECURSIVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       1 ESAREA1 PIC X(20) EXTERNAL.
       1 ESAREA2 PIC X(20) EXTERNAL.
       1 ESAREA3 PIC X(20) EXTERNAL.
       1 WSAREA1 PIC X(20) VALUE 'THIS IS WSAREA1'.
       1 WSAREA2 PIC X(20) VALUE 'THIS IS WSAREA2'.
       1 WSAREA3 PIC X(20) VALUE 'THIS IS WSAREA3'.
       1 XXAREA1 PIC X(20).
       1 XXAREA2 PIC X(20).
       LOCAL-STORAGE SECTION.
       1 LSAREA1 PIC X(20) VALUE 'THIS IS LSAREA1'.
       1 LSAREA2 PIC X(20) VALUE 'THIS IS LSAREA2'.
       1 LSAREA3 PIC X(20) VALUE 'THIS IS LSAREA3'.
       LINKAGE SECTION.
       1 LKAREA1 PIC X(20).
       1 LKAREA2 PIC X(20).
       1 LKAREA3 PIC X(20).
       PROCEDURE DIVISION.
       001-BEGIN.
           DISPLAY 'IN 001-BEGIN' DISPLAY ' SECTION'
           PERFORM 002-PROCESS
           PERFORM 003-SECTION
           PERFORM 004-SECTION
           PERFORM 005-SECTION
           PERFORM 006-SECTION
           GOBACK.
       002-PROCESS.
           DISPLAY 'IN 002-PROCESS'
           EXIT.
       003-SECTION SECTION.
           DISPLAY 'IN 003-SECTION'
           MOVE 'THIS IS WSAREA1' TO WSAREA1
           MOVE 'THIS IS WSAREA2' TO WSAREA2
           MOVE 'THIS IS ESAREA1' TO ESAREA1
           MOVE 'THIS IS ESAREA2' TO ESAREA2
           SET ADDRESS OF LKAREA1 TO ADDRESS OF XXAREA1
           SET ADDRESS OF LKAREA2 TO ADDRESS OF XXAREA2
           MOVE 'THIS IS LKAREA1' TO LKAREA1
           MOVE 'THIS IS LKAREA2' TO LKAREA2
           PERFORM 002-PROCESS
           EXIT.
       004-SECTION SECTION.
           DISPLAY 'IN 004-SECTION'
           EXIT.
       005-SECTION SECTION.
           DISPLAY 'IN 005-SECTION'
           EXIT.
       006-SECTION SECTION.
           DISPLAY 'IN 006-SECTION'
           EXIT.
       END PROGRAM 'ZTPPARAT'.
