       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZTPQSAMT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUT-FILE ASSIGN TESTQSAM
           FILE STATUS IS QSAM-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  OUTPUT-FILE RECORD CONTAINS 80 CHARACTERS
           RECORDING MODE IS F
           DATA RECORD IS OUTPUT-RECORD.
       01  OUTPUT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01  QSAM-STATUS PIC X(2).
       PROCEDURE DIVISION.
           OPEN INPUT OUTPUT-FILE
           PERFORM UNTIL QSAM-STATUS > '04'
              READ OUTPUT-FILE
           END-PERFORM
           CLOSE OUTPUT-FILE
           GOBACK.
       END PROGRAM ZTPQSAMT.
